package com.qgailab.service.constants;

/**
 * @author <a href="mailto:kobe524348@gmail.com">黄钰朝</a>
 * @description
 * @date 2019-07-26 08:39
 */
public enum Message {

    /*
     **************************************************************
     *              用户
     **************************************************************
     */
    /**
     * 密码错误
     */
    password_incorrect,
    /**
     * 用户不存在
     */
    account_not_found,


    /*
     **************************************************************
     *              荣誉
     **************************************************************
     */
    /**
     * 专利不存在
     */
    patent_not_found,

    /**
     * 著作权不存在
     */
    copyright_not_found,

    /**
     * 最近荣誉不存在
     */
    honor_not_found,
    /**
     * 新闻链接不存在
     */
    news_not_found,

    /*
     **************************************************************
     *              关于QG
     **************************************************************
     */

    intro_not_found,
    /**
     * QG历史不存在
     */
    history_not_found,

    /*
     **************************************************************
     *              我们
     **************************************************************
     */

    /**
     * 指导老师不存在
     */
    leader_not_found,

    /**
     * 重要时刻不存在
     */
    moment_not_found,
    /**
     * 奖项不存在
     */
    award_not_found,
    /**
     * 特色不存在
     */
    feature_not_found,
    /*
     **************************************************************
     *              成员
     **************************************************************
     */
    /**
     * 成员不存在
     */
    member_not_found,

    /*
     **************************************************************
     *              项目
     **************************************************************
     */
    /**
     * 项目不存在
     */
    project_not_found,


    /*
     **************************************************************
     *              专栏
     **************************************************************
     */
    /**
     * 领域不存在
     */
    field_not_found,

    /*
     **************************************************************
     *              系统
     **************************************************************
     */
    /**
     * 图片不存在
     */
    image_not_found,
    /**
     * 图片已丢失
     */
    image_has_lost,


    /**
     * 页数不合法
     */
    page_invalid,

    /**
     * 图片不可为空
     */

    image_not_null,
    /**
     * 文件名不可为空
     */
    filename_not_null,

    /**
     * 标题不可为空
     */
    title_not_null,
    /**
     * 成功
     */
    success,
    /**
     * 未知错误，请重试
     */
    please_retry,
    /**
     * 数据库出错
     */
    database_exception,
    /**
     * 参数不足
     */
    parameter_not_enough,
    /**
     * url不能为空
     */
    url_not_null,
    /**
     * 名称不能为空
     */
    name_not_null;
}
